app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "THIS should work too with PUTs ???"], ["updated_at", "2020-08-22 09:30:30.408416"], ["id", 1]]
---
	def update
		@post = Post.find(params[:id])
	  @post.update(params.require(:post).permit(:title, :description))